docs/leets/1574-Shortest-Subarray-to-be-Removed-to-Make-Array-Sorted.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-12-29 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>1574. Shortest Subarray to be Removed to Make Array Sorted</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-11-14
</div>
<div id="content" class="content">
<header>
<h1 class="title">1574. Shortest Subarray to be Removed to Make Array Sorted</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org35cf853">Problem</a></li>
<li><a href="#org9d80394">Solution Description</a></li>
<li><a href="#org8248908">Example</a></li>
<li><a href="#org58817d2">References</a></li>
<li><a href="#orgea65cd0">Solution</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org35cf853" class="outline-2">
<h2 id="org35cf853">Problem</h2>
<div class="outline-text-2" id="text-org35cf853">
<p>
Given an array of integers, the task is to find the length of the shortest subarray that can be removed to make the remaining array sorted in non-decreasing order. The array can contain duplicates, and the result should be the smallest number of elements that need to be removed.
</p>
</div>
</div>

<div id="outline-container-org9d80394" class="outline-2">
<h2 id="org9d80394">Solution Description</h2>
<div class="outline-text-2" id="text-org9d80394">
<p>
To implement a solution, we need to divide the array into two parts: a prefix that is sorted and a suffix that is sorted. The main idea is to find the maximum 'middle' section (between these two parts) that can be removed such that the resulting array is still sorted. This can be achieved in the following steps:
</p>
<ol class="org-ol">
<li>Identify the longest non-decreasing prefix.</li>
<li>Identify the longest non-decreasing suffix.</li>
<li>Try to remove the middle part or some overlapping part between the prefix and suffix to minimize the number of elements removed.</li>
<li>Compare indices from prefix and suffix to find the merging point, ensuring the values do not break the sorted order.</li>
</ol>

<p>
The time complexity is O(n) as we only make one linear pass over the array to determine the prefix and suffix, and an additional linear comparison to find the best merging point. The space complexity is O(1) as we are not using any extra space beyond a few variables.
</p>
</div>
</div>

<div id="outline-container-org8248908" class="outline-2">
<h2 id="org8248908">Example</h2>
<div class="outline-text-2" id="text-org8248908">
<p>
Consider the array = [1, 2, 3, 10, 4, 2, 3, 5]:
</p>
<ul class="org-ul">
<li>The longest non-decreasing prefix is [1, 2, 3] (indices 0 to 2).</li>
<li>The longest non-decreasing suffix is [2, 3, 5] (indices 5 to 7).</li>
<li>By removing the middle section from indices 3 to 4 ([10, 4]), the resulting array [1, 2, 3, 2, 3, 5] is sorted.</li>
</ul>
</div>
</div>

<div id="outline-container-org58817d2" class="outline-2">
<h2 id="org58817d2">References</h2>
<div class="outline-text-2" id="text-org58817d2">
<p>
This problem is related to array manipulation and greedy algorithms. No specific framework is used, but it involves understanding the array structure:
</p>
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Greedy_algorithm">Greedy Algorithms - Wikipedia</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgea65cd0" class="outline-2">
<h2 id="orgea65cd0">Solution</h2>
<div class="outline-text-2" id="text-orgea65cd0">
<p>
We start by implementing the structure of the solution with placeholder return value to allow for user development.
</p>

<p>
<a href="https://leetcode.com/submissions/detail/1453155254/">2024-11-15 Shortest Subarray to be Removed to Make Array Sorted - Submission Detail - LeetCode</a> <code>leetcode.com</code>
</p>


<div class="org-src-container">
<pre class="src src-js">
/**
 * @param {number[]} arr - The input array of integers.
 * @returns {number} The length of the shortest subarray to be removed.
 */
function shortestSubarrayToRemove(arr) {
    const log = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.log;

    if (arr.length &lt; 2) {
        return 0;
    }

    let begin = 0;
    let end = arr.length - 1;

    while (begin &lt; arr.length - 1 &amp;&amp; arr[begin] &lt;= arr[begin + 1]) {
        begin += 1;
    }

    if (begin === arr.length - 1) {
        return 0;
    }

    while (end &gt; 0 &amp;&amp; arr[end - 1] &lt;= arr[end]) {
        end -= 1;
    }

    let minToRemove = Math.min(arr.length - begin - 1, end);

    let i = 0;
    let j = end;

    while (i &lt;= begin &amp;&amp; j &lt; arr.length) {
        if (arr[i] &lt;= arr[j]) {
            minToRemove = Math.min(minToRemove, j - i - 1);
            i += 1;
        } else {
            j += 1;
        }
    }

    return minToRemove;
}

// Test cases
const testCases = [
    { arr: [1, 2, 3, 10, 4, 2, 3, 5], expected: 3 },
    { arr: [5, 1, 2, 3, 4], expected: 1 },
    { arr: [1, 2, 3], expected: 0 },
    { arr: [1], expected: 0 }, // Single element
    { arr: [7, 6, 5, 4], expected: 3 }, // Fully descending
];

testCases.forEach((test, index) =&gt; {
    const result = shortestSubarrayToRemove(test.arr);
    console.log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : '\x1bFailed'} (Expected: ${test.expected}, Got: ${result})`);
});

</pre>
</div>

<pre class="example" id="org7c45d03">
: Test Case 1: Passed (Expected: 3, Got: 3)
: Test Case 2: Passed (Expected: 1, Got: 1)
: Test Case 3: Passed (Expected: 0, Got: 0)
: Test Case 4: Passed (Expected: 0, Got: 0)
: Test Case 5: Passed (Expected: 3, Got: 3)
: undefined
</pre>


<p>
This skeleton provides a starting point. Upon completion, you should replace the placeholder return with your implementation logic. Test cases are provided to ensure comprehensive coverage.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
